Revit 2022 API
ElectricalSystemSet.ReverseIterator Method
Retrieve a backward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public virtual ElectricalSystemSetIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As ElectricalSystemSetIterator
Visual C++
public:
virtual ElectricalSystemSetIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the set.
See Also
ElectricalSystemSet Class
Autodesk.Revit.DB.Electrical Namespace